#+TITLE: Napredne tehnike programiranja u Python-u
#+EXPORT_FILE_NAME: index.html
#+SETUPFILE: ../../courses-startup.org

** ~__setattr__~ i ~@property~
   
   #+BEGIN_SRC python :results output
   class A:
    @property
    def a(self):
        print("get")
        return 5
    @a.setter
    def a(self, val):
        print("set")
   
    def __setattr__(self, name, value):
        if name == 'a':
            print('setattr')
        super().__setattr__(name, value)
   a = A()
   a.a = 10
   out = a.a
   #+END_SRC

   #+RESULTS:
   : setattr
   : set
   : get

** Problem sa /properties/
   
   #+BEGIN_SRC python :results output
    class Order:
        def __init__(self, name, price, quantity):
            self._name = name
            self.price = price
            self._quantity = quantity

        @property
        def quantity(self):
            return self._quantity

        @quantity.setter
        def quantity(self, value):
            if value < 0:
                raise ValueError('Cannot be negative.')
            self._quantity = value

        def total(self):
            return self.price * self.quantity

    apple_order = Order('apple', 1, 10)
    print(apple_order.total())
    try:
        apple_order.quantity = -10
    except ValueError as e:
        print('Woops:', str(e))
   #+END_SRC

   #+RESULTS:
   : 10
   : Woops: Cannot be negative.

#+attr_html: :class footer :style clear: both;
https://dev.to/dawranliou/writing-descriptors-in-python-36

** Rešenje upotrebom deskriptora (2)
   
   #+BEGIN_SRC python :session :results output
   class Order:
   
      price = NonNegative()
      quantity = NonNegative()

      def __init__(self, name, price, quantity):
          self._name = name
          self.price = price
          self.quantity = quantity

      def total(self):
          return self.price * self.quantity
        
   apple_order = Order('apple', 1, 10)
   print(apple_order.total())
    
   try:
       apple_order.quantity = -10
   except ValueError as e:
       print('Woops:', str(e))
   #+END_SRC

   #+RESULTS:
   : 10
   : Woops: Cannot be negative.

  #+attr_html: :class footer :style clear: both;
  https://dev.to/dawranliou/writing-descriptors-in-python-36

** ~chain~
- Iteracije kroz više iterabilnih objekata prema zadatom redosledu.
- Tretiranje niza sekvenci kao jedne sekvence.

Ekvivalentno sa sledećim Python kodom:
#+BEGIN_SRC python
def chain(*iterables):
    for it in iterables:
        for element in it:
            yield element
#+END_SRC

Upotreba:

#+BEGIN_SRC python :results output
from itertools import chain
a = [1, 2, 3]
b = 'abc'
for i in chain(a, b):
    print(i, end=' ')
#+END_SRC

#+RESULTS:
: 1 2 3 a b c 

** ~cycle~
- Beskonačna iteracija kroz zadati iterabilni objekat *u krug*.

Ekvivalentno sa:
#+BEGIN_SRC python :language python
def cycle(iterable):
    saved = []
    for element in iterable:
        yield element
        saved.append(element)
    while saved:
        for element in saved:
              yield element
#+END_SRC

Primer:

#+BEGIN_SRC python :results value
from itertools import cycle, islice
return list(islice(cycle('ABCD'), 10))
#+END_SRC

#+RESULTS:
| A | B | C | D | A | B | C | D | A | B |

** ~filter~
- Kreira iterator koji filtrira i vraća samo one elemente zadatog iterabilnog
  objekta koji zadovoljavaju određeni predikat.
- U Python 2 ~ifilter~ radi kao generator dok ~filter~ radi kao obična funkcija.
  
Ekvivalentno sa:
#+BEGIN_SRC python
def filter(predicate, iterable):
    if predicate is None:
        predicate = bool
    for x in iterable:
        if predicate(x):
            yield x
#+END_SRC

Primer:
#+BEGIN_SRC python :results value
return list(filter(lambda x: x % 2, range(10)))
#+END_SRC

#+RESULTS:
| 1 | 3 | 5 | 7 | 9 |

** ~map~
- Kreira iterator koji vraća vrednost zadate funkcije gde se parametri zadate
  funkcije uzimaju iz datih iterabilnih objekata.
- U Python 2 ~imap~ radi kao generator dok ~map~ radi kao obična funkcija.

Ekvivalentno sa:

#+BEGIN_SRC python
def map(function, *iterables):
    iterables = [iter(x) for x in iterables]
    while True:
        args = [next(it) for it in iterables]
        if function is None:
            yield tuple(args)
        else:
            yield function(*args)
#+END_SRC

Primer:

#+BEGIN_SRC python :results value
return list(map(pow, (2, 3, 10), (5, 2, 3)))
#+END_SRC

#+RESULTS:
| 32 | 9 | 1000 |

** ~zip~
- Kreira iterator koji istovremeno iterira kroz više iterabilnih objekata
  vraćajući n-torke gde svaki element pripada odgovarajućem iterabilnom objektu.
- U Python 2 ~izip~ radi kao generator dok ~zip~ radi kao obična funkcija.
- Ekvivalentno sa:

#+BEGIN_SRC python
def zip(*iterables):
    iterators = map(iter, iterables)
    while iterators:
        yield tuple(map(next, iterators))
#+END_SRC

Primer:

#+BEGIN_SRC python :results value
return list(zip('ABCD', 'xy'))
#+END_SRC

#+RESULTS:
| A | x |
| B | y |

** ~dropwhile~
- Iterator koji odbacuje prve elemente za koje je dati predikat istinit i zatim
  vraća sve preostale redom.
- Ekvivalentno sa:

#+BEGIN_SRC python
def dropwhile(predicate, iterable):
    iterable = iter(iterable)
    for x in iterable:
        if not predicate(x):
            yield x
            break
    for x in iterable:
        yield x
#+END_SRC

Primer:

#+BEGIN_SRC python :return value
from itertools import dropwhile
return list(dropwhile(lambda x: x < 5, [1, 4, 6, 4, 1]))
#+END_SRC

#+RESULTS:
| 6 | 4 | 1 |


** ~takewhile~
- Iterator koji vraća elemente dok je predikat zadovoljen.
- Ekvivalentno sa:
#+BEGIN_SRC python
def takewhile(predicate, iterable):
    for x in iterable:
        if predicate(x):
            yield x
        else:
            break
#+END_SRC

Primer:

#+BEGIN_SRC python :results value
from itertools import takewhile
return list(takewhile(lambda x: x < 5, [1, 4, 6, 4, 1]))
#+END_SRC

#+RESULTS:
| 1 | 4 |

